RU/Files/day_2_Ext/ShapeOptCases/run/optimisation/rampPressure/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (  0   2   -0.1)
    (  3   2   -0.1)
    (  7   0   -0.1)
    ( 12   0   -0.1)
    (  0   4   -0.1)
    (  3   4   -0.1)
    (  7   4   -0.1)
    ( 12   4   -0.1)

    (  0   2    0.1)
    (  3   2    0.1)
    (  7   0    0.1)
    ( 12   0    0.1)
    (  0   4    0.1)
    (  3   4    0.1)
    (  7   4    0.1)
    ( 12   4    0.1)
);


edges
();


blocks
(
    hex (0 1 5 4 8 9 13 12) (30 30 1) simpleGrading (0.2 2 1)
    hex (1 2 6 5 9 10 14 13) (70 30 1) simpleGrading (1 2 1)
    hex (2 3 7 6 10 11 15 14) (30 30 1) simpleGrading (5 2 1)
);

patches
(
    patch inlet
    (
        4(0 8 12 4)
    )
    patch outlet
    (
        4(3 7 15 11)
    )
    wall bottomIn
    (
        4(0 1 9 8)
    )
    wall bottomRamp
    (
        4(1 2 10 9)
    )
    wall bottomOut
    (
        4(2 3 11 10)
    )

    wall top
    (
        4(4 12 13 5)
        4(5 13 14 6)
        4(6 14 15 7)
    )
);

mergePatchPairs
(
);


// ************************************************************************* //
