RU/Files/day_2_Ext/ShapeOptCases/run/optimisation/rampPressure/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          amgSolver;
        cycle           W-cycle;
        policy          AAMG;
        nPreSweeps      0;
        nPostSweeps     2;
        groupSize       4;
        minCoarseEqns   30;
        nMaxLevels      100;
        scale           on;
        smoother        ILU;

        minIter         0;
        maxIter         500;
        tolerance       1e-8;
        relTol          0.01;
    };

    U
    {
        solver           BiCGStab;
        preconditioner   Cholesky;

        tolerance        1e-06;
        relTol           0.01;
        minIter          0;
        maxIter          200;
    };
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    U 0.5;
    p 0.2;
}


// ************************************************************************* //
